#include <iostream>
using namespace std;

int main()
{
    int Y { 0 };
    int U { 0 };
    int V { 0 };
    int R { 0 };
    int G { 0 };
    int B { 0 };

    ///////////////////////////////////////////////////////////
    ///YUV转为RGB

    cout << "请输出 Y U V以空格分开" << endl;
    cin >> Y >> U >> V;
    cout << "Y:" << Y << " U:" << U << " V:" << V << endl;

    R = Y + 1.13983 * (V - 128);
    G = Y - 0.39465 * (U - 128) - 0.58060 * (V - 128);
    B = Y + 2.03211 * (U - 128);

    // 确保 RGB 分量在 0 到 255 之间
    /* 
    三元运算符是一种简洁的条件运算符，语法为 (条件) ? 值1 : 值2。
    如果条件为真，则返回值1；如果条件为假，则返回值2。
    在这个代码中，三元运算符用于确保每个分量都在有效范围内。
    */
    R = (R < 0) ? 0 : (R > 255) ? 255 : R; // 如果R小于0，则取0；如果R大于255，则取255；否则取R
    G = (G < 0) ? 0 : (G > 255) ? 255 : G;
    B = (B < 0) ? 0 : (B > 255) ? 255 : B;

    cout << "R:" << R << " G:" << G << " B:" << B << endl;

    ///////////////////////////////////////////////////////////
    ///RGB转为YUV

    cout << "请输出 R G B以空格分开" << endl;
    cin >> R >> G >> B;
    cout << "R:" << R << " G:" << G << " B:" << B << endl;

    Y = 0.299 * R + 0.587 * G + 0.114 * B;
    U = -0.14713 * R - 0.28886 * G + 0.436 * B + 128;
    V = 0.615 * R - 0.51498 * G - 0.10001 * B + 128;

    // 确保 YUV 分量在 0 到 255 之间
    Y = (Y < 0) ? 0 : (Y > 255) ? 255 : Y;
    U = (U < 0) ? 0 : (U > 255) ? 255 : U;
    V = (V < 0) ? 0 : (V > 255) ? 255 : V;

    cout << "Y:" << Y << " U:" << U << " V:" << V << endl;
}
